Revit 2026 API

# DocumentClosingEventArgs Properties

---

The DocumentClosingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Document | The document associated with the event. (Inherited from RevitAPIPreDocEventArgs) |
|  | DocumentId | Id of the document that is about to be closed. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |

#### Reference

DocumentClosingEventArgs Class

Autodesk.Revit.DB.Events Namespace